Revit 2026 API
RevisionsOnSheetUIServiceData Class
 UI data wrapper for RevisionsOnSheetUIService.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RevisionsOnSheetUIServiceData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class RevisionsOnSheetUIServiceData : IDisposable
Public Class RevisionsOnSheetUIServiceData
	Implements IDisposable
public ref class RevisionsOnSheetUIServiceData : IDisposable
type RevisionsOnSheetUIServiceData =
    class
        interface IDisposable
    end
The RevisionsOnSheetUIServiceData type exposes the following members.
Properties
Name | Description
Document |  return the document
IsReset |  flag to indicate the value has been reset
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
ParamId |  the parameter id
Top
Methods
Name | Description
Dispose | Releases all resources used by the RevisionsOnSheetUIServiceData
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetParentHwnd |  return the parent handle
GetRevitElementIds |  return the list of revit Element Ids
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.UI Namespace